<a href="https://colab.research.google.com/github/wli1992/wli1992/blob/main/Copy_of_CIDM6351_HW8_Template.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1  align="center">CIDM6351-Homework8 (10 points)</h1>

* **Save a copy to your Google Drive and to answer on your copy**
* **Submit the share link of your JupyterNotebook to WTClass**
* Please follow the instruction in 'Student Guides' folder if you didn't how to submit the share link to WTClass.

## Following the instructions to manipulate DataFrames

## Q1 (2 points): Load the csv file to a dataframe and show it

In [ ]:
# link of the csv file
csv = 'https://raw.githubusercontent.com/czwtamu/CIDM6351/main/HW10.csv'

import pandas as pd

csv_url = 'https://raw.githubusercontent.com/czwtamu/CIDM6351/main/HW10.csv'

df = pd.read_csv(csv_url)

print(df)

    Name           Phone   ZipCode
0  Alice  # 123-456-7890     79119
1    Bob  # 123-456-1111     79110
2  Cathy  # 123-456-7821       NaN
3  David  # 123-456-7822     12378
4   Ella  # 123-456-7893       NaN
5   Jack  # 123-456-7826  111-90-1
6   Tony  # 123-456-7800  {234123}

In [ ]:
# sample answer

    Name           Phone   ZipCode
0  Alice  # 123-456-7890     79119
1    Bob  # 123-456-1111     79110
2  Cathy  # 123-456-7821       NaN
3  David  # 123-456-7822     12378
4   Ella  # 123-456-7893       NaN
5   Jack  # 123-456-7826  111-90-1
6   Tony  # 123-456-7800  {234123}

## Q2(2 point) Remove the rows that contain missing values and show the result

Hint: Pandas provides a method called ```.dropna()``` to remove data with NaN values

In [ ]:
import pandas as pd

csv_url = 'https://raw.githubusercontent.com/czwtamu/CIDM6351/main/HW10.csv'

df = pd.read_csv(csv_url)

df.dropna(inplace=True)

print(df)

    Name           Phone   ZipCode
0  Alice  # 123-456-7890     79119
1    Bob  # 123-456-1111     79110
3  David  # 123-456-7822     12378
5   Jack  # 123-456-7826  111-90-1
6   Tony  # 123-456-7800  {234123}

In [ ]:
# sample answer

    Name           Phone   ZipCode
0  Alice  # 123-456-7890     79119
1    Bob  # 123-456-1111     79110
3  David  # 123-456-7822     12378
5   Jack  # 123-456-7826  111-90-1
6   Tony  # 123-456-7800  {234123}

## Q3 (2 points) remove the ```#``` from Phone numbers

In [ ]:
import pandas as pd

csv_url = 'https://raw.githubusercontent.com/czwtamu/CIDM6351/main/HW10.csv'

df = pd.read_csv(csv_url)

df['Phone'] = df['Phone'].str.replace('#', '')

print(df)

    Name          Phone   ZipCode
0  Alice   123-456-7890     79119
1    Bob   123-456-1111     79110
2  Cathy   123-456-7821       NaN
3  David   123-456-7822     12378
4   Ella   123-456-7893       NaN
5   Jack   123-456-7826  111-90-1
6   Tony   123-456-7800  {234123}

In [ ]:
# sample answer

    Name          Phone   ZipCode
0  Alice   123-456-7890     79119
1    Bob   123-456-1111     79110
3  David   123-456-7822     12378
5   Jack   123-456-7826  111-90-1
6   Tony   123-456-7800  {234123}

## Q4 (4 point) clean the values of ZipCode and only keep numbers

In [ ]:
import pandas as pd

csv_url = 'https://raw.githubusercontent.com/czwtamu/CIDM6351/main/HW10.csv'

df = pd.read_csv(csv_url)

df['ZipCode'] = df['ZipCode'].str.extract('(\d+)')

print(df)

    Name           Phone ZipCode
0  Alice  # 123-456-7890   79119
1    Bob  # 123-456-1111   79110
2  Cathy  # 123-456-7821     NaN
3  David  # 123-456-7822   12378
4   Ella  # 123-456-7893     NaN
5   Jack  # 123-456-7826     111
6   Tony  # 123-456-7800  234123

In [ ]:
# sample answer

    Name          Phone ZipCode
0  Alice   123-456-7890   79119
1    Bob   123-456-1111   79110
3  David   123-456-7822   12378
5   Jack   123-456-7826  111901
6   Tony   123-456-7800  234123